{
  "news":
  [
  {
    "id": 1,
    "title": "Launch of the 'Iron Eagle' F-16 mission, a symbol of the strength of the Thai Air Force.",
    "summary": "The F-16's versatility has made it popular and selected by many air forces.",
    "content": "The F-16 Fighting Falcon is one of the most significant and successful aircraft in Air Force history, developed by General Dynamics for the United States Air Force.",
    "status": 1,
    "reporter": "Grace Miller",
    "date": "2025-08-10",
    "time": "09:10",
    "image": "https://www.tnnthailand.com/static/images/5eea94df-aa66-4ffa-bb33-00ba32aeb319.jpg",
    "vote": { "real": 81, "fake": 41 }
  },
  {
    "id": 2,
    "title": "The spy war: 'Mapping drones', secret weapons that pinpoint location, waiting to erupt",
    "summary": "The classification of mapping drones and spy drones can be observed from their flight as follows: 1. Mapping drones fly in a rectangular pattern.",
    "content": "Spy war: Mapping drones are secret weapons that can identify coordinates. They can fly for 6-12 hours and are controlled by satellite systems. Experts recommend observing the flight of mapping drones that collect coordinates in a square shape, while spy drones fly in circles.",
    "status": 1,
    "reporter": "Alex Turner",
    "date": "2025-08-09",
    "time": "18:40",
    "image": "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa6rfdyv16NyOI6AkyTPscDFaFuUTom7x29UNAor56zAgFCaVWOep.webp",
    "vote": { "real": 98, "fake": 14 }
  },
  {
    "id": 3,
    "title": "Electric Bus Fleet Launched to Cut Urban Emissions",
    "summary": "City unveils 60 new fast-charging buses with onboard Wi-Fi and accessibility upgrades.",
    "content": "The municipal transport agency says the fleet will reduce diesel usage by 4 million liters annually. The rollout includes depot chargers and two public rapid-charging stations along the busiest corridor.",
    "status": 1,
    "reporter": "John Anderson",
    "date": "2025-08-11",
    "time": "09:30",
    "image": "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa6rfdWatDQMisMXsaXfRZ2TPZxPDRXdsoxuMnG3ANBbvGxmXpII4.webp",
    "vote": { "real": 120, "fake": 7 }
  },
  {
    "id": 4,
    "title": "Thailand accuses Cambodia of violating hours-old ceasefire",
    "summary": "Thailand, which had initially been reluctant to negotiate, agreed to the talks.",
    "content": "Thailand has accused Cambodia of deliberately violating a ceasefire the two countries agreed on Monday to end border clashes that have killed at least 33 people and displaced thousands.",
    "status": 0,
    "reporter": "Sarah Mitchell",
    "date": "2025-08-08",
    "time": "10:20",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/b92f/live/29faf8c0-6c37-11f0-9453-d5f74ab08fdc.jpg.webp",
    "vote": { "real": 11, "fake": 176 }
  },
  {
    "id": 5,
    "title": "Thailand and Cambodia agree to 'immediate ceasefire'",
    "summary": "Shaking felt across several cities; emergency crews assess damage to older buildings.",
    "content": "The national seismology center recorded multiple aftershocks. Authorities reported power cuts in two districts and urged residents to check for gas leaks before returning indoors.",
    "status": 1,
    "reporter": "Hannah Ortiz",
    "date": "2025-08-07",
    "time": "22:14",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/2d5a/live/39d60ab0-6ba5-11f0-89ea-4d6f9851f623.jpg.webp",
    "vote": { "real": 165, "fake": 9 }
  },
  {
    "id": 6,
    "title": "Private Rocket Successfully Delivers Weather Satellite",
    "summary": "The mission places a next-gen climate satellite into sun-synchronous orbit.",
    "content": "The launcher lifted off at dawn and deployed the satellite 58 minutes later. The spacecraft will provide higher-resolution cloud and storm data to improve regional forecasts.",
    "status": 1,
    "reporter": "Marcus Chen",
    "date": "2025-08-06",
    "time": "05:32",
    "image": "https://images.unsplash.com/photo-1446776811953-b23d57bd21aa",
    "vote": { "real": 142, "fake": 6 }
  },
  {
    "id": 7,
    "title": "Thai Air Force Vows to Prioritise Civilian Safety in F-16 Air Operations",
    "summary": "Royal Thai Air Force clarifies its operational guidelines, highlighting its commitment to international humanitarian law",
    "content": "The Royal Thai Air Force (RTAF) has publicly outlined the five core principles of international humanitarian law (IHL) that govern its air operations, including those conducted by its F-16 fighter jets. The RTAF posted the statement on its official Facebook page, reassuring the public of its commitment to avoiding civilian harm. According to the RTAF, the principles are derived from the Additional Protocol I to the Geneva Conventions (1977) and customary law. The public statement comes amid a period of heightened regional tension, with the RTAF's clarification of its operational framework seen as a move to build public trust and demonstrate its adherence to international standards.",
    "status": 1,
    "reporter": "Lena Park",
    "date": "2025-08-13",
    "time": "23:30",
    "image": "https://media.nationthailand.com/uploads/images/md/2025/08/5oTOZtmcHRsE4s6OzxkM.webp",
    "vote": { "real": 117, "fake": 13 }
  },
  {
    "id": 8,
    "title": "Thailand and Cambodia to Hold Border Talks Amid Troop Movements and Minefield Concerns",
    "summary": "ASEAN military attachés to inspect border as Thailand urges Cambodia to cooperate on mine clearance efforts",
    "content": "Thailand’s Special Task Force (STF) will hold Regional Border Committee meetings with Cambodia this month to address border issues, including landmine clearance. Rear Admiral Surasant Kongsiri said the situation remains stable, though Cambodian troop reinforcements are being monitored. An ASEAN delegation, led by Malaysia’s military attaché, will visit Ubon Ratchathani and the 2nd Army Region on August 14 to assess the situation and its impact on local communities, with findings to be presented the next day. Thailand remains concerned about extensive landmine presence and accuses Cambodia of continuing to lay mines. The Foreign Ministry is engaging the ASEAN Regional Mine Action Center (ARMAC) to push for stronger cooperation with the Thai Mine Action Centre (TMAC) to improve clearance efforts and ensure civilian safety.",
    "status": 0,
    "reporter": "Emily Carter",
    "date": "2025-08-10",
    "time": "14:45",
    "image": "https://media.nationthailand.com/uploads/images/md/2025/08/xiUSghEemisvhpR78Pbp.webp",
    "vote": { "real": 18, "fake": 201 }
  },
  {
    "id": 9,
    "title": "Ad Hoc Centre for Thai-Cambodian Border Situation clarifies continued operations",
    "summary": "Despite news of its potential closure, the Ad Hoc Centre for the Thailand-Cambodia Border Situation reassures the public that it remains active in maintaining border security.",
    "content": "Following news that the Ad Hoc Centre for the Thailand-Cambodia Border Situation would be deactivated soon due to improved stability along the Thai-Cambodian border, the official Facebook page of Ad Hoc Centre for the Thailand-Cambodia Border Situation posted an update on Wednesday (13 August). The post clarified that the Ad Hoc Centre has not ceased its operations and continues to carry out its assigned duties to maintain security and stability along the border. The National Security Council (NSC) will continue to evaluate the situation and determine the next steps within its mandate and responsibilities.",
    "status": 1,
    "reporter": "Michael Lee",
    "date": "2025-08-13",
    "time": "17:15",
    "image": "https://media.nationthailand.com/uploads/images/md/2025/08/d9WmTBKHAiubYCArl86Z.webp",
    "vote": { "real": 104, "fake": 5 }
  },
  {
    "id": 10,
    "title": "Thailand accuses Cambodia of planting landmines after soldier injured",
    "summary": "Cambodia dismisses Thai army accusation that it breached truce and international law after incident near border.",
    "content": "A Thai soldier was seriously injured by a landmine near the Ta Moan Thom Temple in Surin province, days after Thailand and Cambodia agreed to a ceasefire over border clashes. Thailand accused Cambodia of violating the truce and the Ottawa Convention by planting new mines, warning it may invoke self-defence rights if incidents continue. Cambodia denied the allegations, insisting it has not deployed new mines. This is the fourth recent landmine incident involving Thai soldiers, following deadly July clashes over disputed border temples that killed at least 43 people and displaced over 300,000.",
    "status": 1,
    "reporter": "Priya Shah",
    "date": "2025-08-04",
    "time": "11:22",
    "image": "https://www.aljazeera.com/wp-content/uploads/2025/07/13217397-1753410947.jpg?resize=770%2C513&quality=80",
    "vote": { "real": 133, "fake": 19 }
  },
  {
    "id": 11,
    "title": "Thailand, Cambodia border tensions continue as talks conclude in Malaysia",
    "summary": "Tensions on the Thailand-Cambodia border continue despite ceasefire and as talks between officials from both countries conclude in Malaysia.",
    "content": "Thai and Cambodian officials are holding four-day border talks in Kuala Lumpur to solidify a fragile ceasefire after July’s five days of intense fighting, but troop buildups continue on both sides. The clashes, sparked on July 24, killed at least 24 civilians (16 in Thailand, eight in Cambodia) and displaced over 260,000 people. Tensions remain high near Chong Anma crossing in Thailand’s Ubon Ratchathani province, preventing some 20,000 Thai residents from returning home. Residents describe trauma and destruction from artillery and rocket fire, with homes destroyed and livelihoods lost. Both governments accuse each other of ceasefire violations even as talks proceed, with observers from Malaysia, China, and the US attending. Displaced families hope the negotiations will bring stability, though ongoing military movements keep them anxious.",
    "status": 0,
    "reporter": "Noah Brooks",
    "date": "2025-08-03",
    "time": "08:10",
    "image": "https://www.aljazeera.com/wp-content/uploads/2025/08/NetagitHome-1754530001.jpg?w=770&resize=770%2C513&quality=80",
    "vote": { "real": 23, "fake": 154 }
  },
  {
    "id": 12,
    "title": "Thailand and Cambodia agree to ceasefire: Will it stop the deadly fighting?",
    "summary": "Malaysian PM Anwar Ibrahim, who hosted the talks, says rival sides agree to an ‘unconditional’ ceasefire after five days of deadly fighting.",
    "content": "Thailand’s acting PM Phumtham and Cambodia’s PM Hun Manet agreed to an immediate, unconditional ceasefire after five days of deadly border clashes that killed 36 and displaced over 270,000. Mediated by Malaysia with US and China involvement, the deal includes monitoring plans and a General Border Committee meeting on August 4.",
    "status": 1,
    "reporter": "Olivia Nguyen",
    "date": "2025-08-02",
    "time": "06:55",
    "image": "https://www.aljazeera.com/wp-content/uploads/2025/07/2025-07-24T234343Z_1763079493_RC2BTFALGBMC_RTRMADP_3_THAILAND-CAMBODIA-1-1753714521.jpg?resize=770%2C513&quality=80",
    "vote": { "real": 89, "fake": 7 }
  },
  {
    "id": 13,
    "title": "Thailand says another soldier injured by landmine near Cambodia",
    "summary": "Armoured personnel carriers (APC) are seen on a road near Thailand-Cambodia's border in Sisaket province, the day after the leaders of Cambodia and Thailand agreed to a ceasefire on Monday in a bid to bring an end to their deadliest conflict in more than a decade and ahead of military negotiations.",
    "content": "A Thai soldier was seriously injured by a landmine near the Cambodian border, marking the fourth such incident in a month. The Thai army accused Cambodia of violating the ceasefire and the Ottawa landmine ban, warning it may invoke the right to self-defence if violations continue. Cambodia denied the charges, insisting it has not deployed new mines. The incidents follow deadly July clashes over disputed border temples that killed at least 43 and displaced over 300,000, with a fragile ASEAN-monitored truce now in place. Ask ChatGPT",
    "status": 1,
    "reporter": "Reuters",
    "date": "2025-08-12",
    "time": "16:48",
    "image": "https://www.reuters.com/resizer/v2/J2U7HDZXHFNIZHCE3FVGH7ZFPM.jpg?auth=eb0a4df8ad7683de143651181967cb4071a5ab64f525c69dbcbcfc28f1212e92&width=640&quality=80",
    "vote": { "real": 77, "fake": 6 }
  },
  {
    "id": 14,
    "title": "‘Spy monk’ online joke provokes anger in Cambodia",
    "summary": "A joke claiming Thai monk Luang Ta Such was spying for Thailand has sparked anger in Cambodia, with some demanding his deportation.",
    "content": "The monk, expelled from a Buriram temple for misconduct and known for inflammatory remarks, moved to Cambodia in July and was welcomed by top officials. His Facebook later showed him in Canada, though it’s unclear if he left Cambodia.",
    "status": 0,
    "reporter": "Dana Reeves",
    "date": "2025-08-05",
    "time": "19:35",
    "image": "https://i0.wp.com/thainewsroom.com/wp-content/uploads/2025/07/Fake-image-of-Lunag-Ta-Such-photo-MNG-Online-e1753971575235.webp?ssl=1",
    "vote": { "real": 15, "fake": 138 }
  },
  {
    "id": 15,
    "title": "Thai Soldier Injured, Military Blames Cambodia for Border Landmines",
    "summary": "Thai soldier injured by landmine near the Cambodian border, marking the fourth such incident in recent weeks. Thailand accuses Cambodia of violating the ceasefire and the Ottawa landmine ban, while Cambodia denies planting new mines, blaming old war-era explosives.",
    "content": "A Thai soldier was seriously injured by a landmine near Ta Moan Thom Temple in Surin Province on August 12, just weeks after a ceasefire ended deadly border clashes with Cambodia. The Thai army accused Cambodia of violating the truce and the Ottawa landmine ban, warning it may invoke self-defense rights if incidents continue. Cambodia denied planting new mines, suggesting the blast came from old war-era mines and claiming the soldier strayed from the agreed patrol route. It was the fourth such incident in recent weeks, following clashes over disputed border temples that killed 43 people and displaced over 300,000, with ASEAN observers now monitoring the area.",
    "status": 1,
    "reporter": "Adinda Jasmine",
    "date": "2025-08-13",
    "time": "16:18",
    "image": "https://statik.tempo.co/data/2025/07/28/id_1416377/1416377_720.jpg",
    "vote": { "real": 121, "fake": 8 }
  },
  {
    "id": 16,
    "title": "Cambodia calls for immediate ceasefire with Thailand as death toll rises",
    "summary": "Cambodia has called for an immediate ceasefire with Thailand, as the two countries have seen more than 30 people killed, including civilians, in the ongoing border clashes.",
    "content": "Cambodia's ambassador to the UN, Chhea Keo, said his country asked for a truce unconditionally, adding that Phnom Penh also wanted a peaceful solution of the dispute.",
    "status": 1,
    "reporter": "Ivy Collins",
    "date": "2025-08-11",
    "time": "07:05",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/0e10/live/4b878f00-69ce-11f0-8466-2ddd2c2f7340.jpg.webp",
    "vote": { "real": 101, "fake": 12 }
  },
  {
    "id": 17,
    "title": "Trump says US will work with Thailand and Cambodia, adds both 'want to settle'",
    "summary": "US President Donald Trump said on Sunday he believed both Thailand and Cambodia wanted to settle their differences after he told the leaders of both countries that he would not conclude trade deals with them unless they ended their fighting.",
    "content": "Former US President Donald Trump said he spoke with the prime ministers of Thailand and Cambodia, believing both now “want to settle” their border conflict. US Secretary of State Marco Rubio confirmed State Department officials were in Malaysia to support peace talks, co-organised by the US and with China’s participation. The mediation, chaired by Malaysian PM Anwar Ibrahim, comes after the deadliest fighting in over a decade, sparked by a May border skirmish and escalating into artillery exchanges that killed over 30 and displaced more than 200,000.",
    "status": 1,
    "reporter": "Brian Cole",
    "date": "2025-07-28",
    "time": "13:15",
    "image": "https://media.nationthailand.com/uploads/images/md/2025/07/VBwVzhZl0p5sPvVlq4Cr.webp",
    "vote": { "real": 83, "fake": 11 }
  },
  {
    "id": 18,
    "title": "Thailand’s Constitutional Court to decide prime minister Paetongtarn Shinawatra’s fate amid Cambodia spat",
    "summary": "ChatGPT said: Thailand’s Constitutional Court will decide on August 29 whether to remove PM Paetongtarn Shinawatra over alleged unethical conduct in handling a Cambodia border dispute. Accused of undermining the military in a leaked call, she has been suspended from duty but denies wrongdoing.",
    "content": "Thailand’s Constitutional Court will rule on August 29 on a case seeking to remove Prime Minister Paetongtarn Shinawatra over her handling of a border dispute with Cambodia. Filed by conservative senators, the case accuses her of unethical conduct, citing a leaked call where she addressed Cambodian leader Hun Sen as “uncle” and referred to a Thai military commander as her “opponent.” Suspended from duty since last month, Paetongtarn insists she acted in the national interest. If ousted, she would be the third Shinawatra removed early as PM, following her father Thaksin and aunt Yingluck.",
    "status": 0,
    "reporter": "Tom Bradley",
    "date": "2025-08-13",
    "time": "21:00",
    "image": "https://images.unsplash.com/photo-1501594907352-04cda38ebc29",
    "vote": { "real": 12, "fake": 119 }
  },
  {
    "id": 19,
    "title": "The fractured friendship behind the fight at the Thailand-Cambodia border",
    "summary": "Or perhaps it was something simpler: a Machiavellian move by one of Asia's wiliest political survivors.",
    "content": "Many people have faulted Paetongtarn for her conversation with Hun Sen. She appeared to believe that she could resolve their differences by appealing to his friendship with her father, former prime minister Thaksin Shinawatra.",
    "status": 1,
    "reporter": "Elise Wagner",
    "date": "2025-08-09",
    "time": "08:30",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/d97d/live/1b620d70-68dc-11f0-8dbd-f3d32ebd3327.jpg.webp",
    "vote": { "real": 74, "fake": 5 }
  },
  {
    "id": 20,
    "title": "'Don’t miss Trump next time': Australian politician calls for deportation of rock band Tenacious D",
    "summary": "An Australian senator has called for the comedy rock band Tenacious D to be deported after remarks on Trump’s assassination attempt during a concert in Sydney. A poorly timed bad taste quip, or an assault on free speech?",
    "content": "ChatGPT said: At a Sydney concert on July 14, Tenacious D’s Kyle Gass joked “Don’t miss Trump next time” when making a birthday wish, referencing the recent failed assassination attempt on the former US president. The remark drew laughs at the show but sparked backlash online, leading Australian senator Ralph Babet to demand the band’s deportation, calling the comment a call to political violence and urging the prime minister to revoke their visas. Tenacious D, known for their comedic performances, still have four Australian tour dates before heading to the US for Rock the Vote shows. The controversy comes amid broader reactions to the Trump incident, with false social media claims about other celebrities’ comments circulating online.",
    "status": 1,
    "reporter": "Nora Patel",
    "date": "2025-07-16",
    "time": "17:45",
    "image": "https://static.euronews.com/articles/stories/08/57/88/88/1366x768_cmsv2_f2e3d3c3-ed48-5a55-8570-90d9cbcc392a-8578888.jpg",
    "vote": { "real": 88, "fake": 4 }
  }
],
  
  "comments": [
    {
      "id": 1,
      "commentId": 101,
      "newsId": 1,
      "author": "Arthit Wongsakul",
      "authorVerdict": "real",
      "commentText": "The F-16 program has always been a point of pride for the Air Force.",
      "date": "2025-08-12",
      "time": "14:30",
      "images": ["https://i.pinimg.com/736x/31/ea/9a/31ea9a0324756719da71f39be82f22bf.jpg"]
    },
    {
      "id": 2,
      "commentId": 102,
      "newsId": 1,
      "author": "Kawin Saetang",
      "authorVerdict": "fake",
      "commentText": "Feels like a PR stunt rather than an actual operational achievement.",
      "date": "2025-08-12",
      "time": "14:45",
      "images": ["https://i.pinimg.com/736x/3d/24/34/3d2434b89086ad5080661f3090c2aa99.jpg"]
    },
    {
      "id": 3,
      "commentId": 103,
      "newsId": 2,
      "author": "Nalinee Pratum",
      "authorVerdict": "real",
      "commentText": "Mapping drones could be a game changer for border surveillance.",
      "date": "2025-08-12",
      "time": "15:05",
      "images": ["https://i.pinimg.com/736x/24/1d/40/241d402e119891e89ed9d00ff86b7deb.jpg"]
    },
    {
      "id": 4,
      "commentId": 104,
      "newsId": 2,
      "author": "Thanapol Rerkchai",
      "authorVerdict": "fake",
      "commentText": "They overstate the drone’s capability—it’s not that precise.",
      "date": "2025-08-12",
      "time": "15:15",
      "images": ["https://i.pinimg.com/736x/dc/0c/a2/dc0ca298b9d7f1dfe4150655936762e2.jpg"]
    },
    {
      "id": 13,
      "commentId": 113,
      "newsId": 7,
      "author": "Pimlada Kittikun",
      "authorVerdict": "real",
      "commentText": "Glad to see the Air Force reaffirming commitment to humanitarian law.",
      "date": "2025-08-14",
      "time": "10:15",
      "images": ["https://i.pinimg.com/736x/bc/a2/68/bca268d27008fa5ca18f9166aca69cf1.jpg"]
    },
    {
      "id": 14,
      "commentId": 114,
      "newsId": 7,
      "author": "Krit Veeranon",
      "authorVerdict": "fake",
      "commentText": "They say this now, but I doubt operations will truly change.",
      "date": "2025-08-14",
      "time": "10:40",
      "images": ["https://i.pinimg.com/736x/fd/d4/8a/fdd48a0beed7defa8e9cfffebe8cfb41.jpg"]
    },
    {
      "id": 15,
      "commentId": 115,
      "newsId": 8,
      "author": "Suda Namsai",
      "authorVerdict": "real",
      "commentText": "Hope these talks really lead to safer conditions along the border.",
      "date": "2025-08-11",
      "time": "08:20",
      "images": ["https://i.pinimg.com/736x/7e/b5/5e/7eb55e285b5248d08e742b7056aa2dce.jpg"]
    },
    {
      "id": 16,
      "commentId": 116,
      "newsId": 8,
      "author": "Wasan Thiradej",
      "authorVerdict": "fake",
      "commentText": "Talks won’t solve anything if both sides keep planting mines.",
      "date": "2025-08-11",
      "time": "08:35",
      "images": ["https://i.pinimg.com/736x/23/34/af/2334aff129a07613c9b8a84d252a62f9.jpg"]
    },
    {
      "id": 17,
      "commentId": 117,
      "newsId": 9,
      "author": "Jirapat Lertchai",
      "authorVerdict": "real",
      "commentText": "Good that the centre remains active—security is still needed.",
      "date": "2025-08-13",
      "time": "18:05",
      "images": ["https://i.pinimg.com/736x/8f/96/9d/8f969dc21c79b3af3bb98fd9378f1112.jpg"]
    },
    {
      "id": 18,
      "commentId": 118,
      "newsId": 9,
      "author": "Phurichaya Suksri",
      "authorVerdict": "fake",
      "commentText": "They just don’t want to admit they’re winding things down quietly.",
      "date": "2025-08-13",
      "time": "18:22",
      "images": ["https://i.pinimg.com/736x/ce/89/af/ce89afece8d60b7a30e02aeddc5ccfd4.jpg"]
    },
    {
      "id": 19,
      "commentId": 119,
      "newsId": 10,
      "author": "Thanida Maneerat",
      "authorVerdict": "real",
      "commentText": "If new mines were found, that’s a clear breach of international law.",
      "date": "2025-08-04",
      "time": "13:10",
      "images": ["https://i.pinimg.com/736x/22/4c/b1/224cb18e8168c4fd4a96f5d8ccc34346.jpg"]
    },
    {
      "id": 20,
      "commentId": 120,
      "newsId": 10,
      "author": "Anan Prasert",
      "authorVerdict": "fake",
      "commentText": "Looks like political blame-shifting more than hard evidence.",
      "date": "2025-08-04",
      "time": "13:25",
      "images": ["https://i.pinimg.com/736x/01/a7/24/01a724a229aaded29cafd6aba80cc9e5.jpg"]
    },
    {
      "id": 21,
      "commentId": 121,
      "newsId": 11,
      "author": "Siriporn Chaiyasit",
      "authorVerdict": "real",
      "commentText": "Even small progress in Malaysia talks is better than none.",
      "date": "2025-08-03",
      "time": "09:15",
      "images": ["https://i.pinimg.com/736x/dc/0a/f7/dc0af7a35dc760e0f45756b74c86b3b1.jpg"]
    },
    {
      "id": 22,
      "commentId": 122,
      "newsId": 11,
      "author": "Kamonchanok Fongdee",
      "authorVerdict": "fake",
      "commentText": "Troops are still building up—this isn’t real peace.",
      "date": "2025-08-03",
      "time": "09:28",
      "images": ["https://i.pinimg.com/736x/94/91/d9/9491d9d6e0a6d7e755032dcbdf36cb2f.jpg"]
    },
    {
      "id": 23,
      "commentId": 123,
      "newsId": 12,
      "author": "Pakorn Jirasuk",
      "authorVerdict": "real",
      "commentText": "Unconditional ceasefire is the first step to ending the suffering.",
      "date": "2025-08-02",
      "time": "07:15",
      "images": ["https://i.pinimg.com/1200x/78/5b/4a/785b4a242e10668713b72dbdfb84768c.jpg"]
    },
    {
      "id": 24,
      "commentId": 124,
      "newsId": 12,
      "author": "Nimman Kaewwong",
      "authorVerdict": "fake",
      "commentText": "We’ve seen these deals collapse before—don’t get your hopes up.",
      "date": "2025-08-02",
      "time": "07:25",
      "images": ["https://i.pinimg.com/736x/bd/98/d0/bd98d05f64f8b6794fceccf3e50257b3.jpg"]
    },
    {
      "id": 25,
      "commentId": 125,
      "newsId": 13,
      "author": "Sarun Phattharadej",
      "authorVerdict": "real",
      "commentText": "Four mine incidents in a month is alarming—clear them fast.",
      "date": "2025-08-12",
      "time": "17:05",
      "images": ["https://i.pinimg.com/736x/81/3d/c7/813dc78a3416bcfef972373f24b7004a.jpg"]
    },
    {
      "id": 26,
      "commentId": 126,
      "newsId": 13,
      "author": "Chanika Rojanasakul",
      "authorVerdict": "fake",
      "commentText": "These are old war mines—stop blaming Cambodia for everything.",
      "date": "2025-08-12",
      "time": "17:20",
      "images": ["https://i.pinimg.com/736x/12/6b/e4/126be4dce0f8fc71a00caee74f1d101f.jpg"]
    },
    {
      "id": 27,
      "commentId": 127,
      "newsId": 14,
      "author": "Warisa Malai",
      "authorVerdict": "real",
      "commentText": "People shouldn’t overreact to a joke—it’s not espionage.",
      "date": "2025-08-05",
      "time": "20:05",
      "images": ["https://i.pinimg.com/1200x/11/35/c3/1135c39f92895aeb602fde369dcd59b0.jpg"]
    },
    {
      "id": 28,
      "commentId": 128,
      "newsId": 14,
      "author": "Prasert Hinsawat",
      "authorVerdict": "fake",
      "commentText": "This proves foreign religious figures can’t be trusted here.",
      "date": "2025-08-05",
      "time": "20:20",
      "images": ["https://i.pinimg.com/736x/48/fc/1a/48fc1a1898559460f7a3b99da69854eb.jpg"]
    },
    {
      "id": 29,
      "commentId": 129,
      "newsId": 15,
      "author": "Chutima Techawong",
      "authorVerdict": "real",
      "commentText": "Landmine use must be condemned—too many lives at risk.",
      "date": "2025-08-13",
      "time": "17:00",
      "images": ["https://i.pinimg.com/736x/ec/87/1d/ec871d8af2aff5075ecbc863ec00d170.jpg"]
    },
    {
      "id": 30,
      "commentId": 130,
      "newsId": 15,
      "author": "Teerapat Dhammasak",
      "authorVerdict": "fake",
      "commentText": "Sounds like Thailand is just making excuses for military failures.",
      "date": "2025-08-13",
      "time": "17:12",
      "images": ["https://i.pinimg.com/736x/c2/99/17/c29917ff247597f14396a4a7b8119b23.jpg"]
    },
    {
      "id": 31,
      "commentId": 131,
      "newsId": 16,
      "author": "Ratchanok Limsakul",
      "authorVerdict": "real",
      "commentText": "An unconditional truce is exactly what’s needed now.",
      "date": "2025-08-11",
      "time": "08:15",
      "images": ["https://i.pinimg.com/736x/ae/29/8f/ae298ff0047b2e8653dec58e6abcbabc.jpg"]
    },
    {
      "id": 32,
      "commentId": 132,
      "newsId": 16,
      "author": "Kornchai Yodsri",
      "authorVerdict": "fake",
      "commentText": "They’ve said ‘ceasefire’ before—never lasts more than a week.",
      "date": "2025-08-11",
      "time": "08:27",
      "images": ["https://i.pinimg.com/736x/d0/40/f0/d040f09fa5902e0857719737b0f6b871.jpg"]
    },
    {
      "id": 33,
      "commentId": 133,
      "newsId": 17,
      "author": "Natasha Boonyasit",
      "authorVerdict": "real",
      "commentText": "International pressure might finally push both sides to settle.",
      "date": "2025-07-28",
      "time": "13:40",
      "images": ["https://i.pinimg.com/736x/d2/3a/34/d23a345dfd26e1420df18f88b5f676fe.jpg"]
    },
    {
      "id": 34,
      "commentId": 134,
      "newsId": 17,
      "author": "Piriya Sutham",
      "authorVerdict": "fake",
      "commentText": "Trump’s involvement won’t make any real difference here.",
      "date": "2025-07-28",
      "time": "13:55",
      "images": ["https://i.pinimg.com/736x/18/19/c4/1819c47f624c033dd01c3a0bb8a85c41.jpg"]
    },
    {
      "id": 35,
      "commentId": 135,
      "newsId": 18,
      "author": "Benjamas Ithichai",
      "authorVerdict": "real",
      "commentText": "This court case could shift Thailand’s political landscape.",
      "date": "2025-08-13",
      "time": "21:15",
      "images": ["https://i.pinimg.com/736x/1b/de/85/1bde85b859a3ac61516fcc6bc73a1fff.jpg"]
    },
    {
      "id": 36,
      "commentId": 136,
      "newsId": 18,
      "author": "Kantaphon Charoensap",
      "authorVerdict": "fake",
      "commentText": "The case is just political theater—won’t lead to real change.",
      "date": "2025-08-13",
      "time": "21:25",
      "images": ["https://i.pinimg.com/736x/54/5d/e0/545de075b50155957e2488a1af19030a.jpg"]
    },
    {
      "id": 37,
      "commentId": 137,
      "newsId": 19,
      "author": "Prangrung Srisawat",
      "authorVerdict": "real",
      "commentText": "Her reliance on personal connections shows the fragility of diplomacy.",
      "date": "2025-08-09",
      "time": "08:45",
      "images": ["https://i.pinimg.com/736x/49/0c/1c/490c1c17f39169144e79ea3c3ddb0101.jpg"]
    },
    {
      "id": 38,
      "commentId": 138,
      "newsId": 19,
      "author": "Adisorn Vichairat",
      "authorVerdict": "fake",
      "commentText": "This so-called friendship is just a cover for political deals.",
      "date": "2025-08-09",
      "time": "08:55",
      "images": ["https://i.pinimg.com/736x/11/f9/91/11f991d18ce385e7f1acd82fb83b7b80.jpg"]
    },
    {
      "id": 39,
      "commentId": 139,
      "newsId": 20,
      "author": "Nicha Phrompan",
      "authorVerdict": "real",
      "commentText": "Comedians should have the right to make edgy jokes, even about politics.",
      "date": "2025-07-16",
      "time": "18:00",
      "images": ["https://i.pinimg.com/736x/fd/ef/05/fdef05ef7e3a363113bf08642a3a8bb3.jpg"]
    },
    {
      "id": 40,
      "commentId": 140,
      "newsId": 20,
      "author": "Pongsatorn Amnat",
      "authorVerdict": "fake",
      "commentText": "That was an unacceptable thing to say—completely crossed the line.",
      "date": "2025-07-16",
      "time": "18:12",
      "images": ["https://i.pinimg.com/736x/31/ea/9a/31ea9a0324756719da71f39be82f22bf.jpg"]
    },
    {
    "id": 41,
    "commentId": 141,
    "newsId": 3,
    "author": "Nattaporn W.",
    "authorVerdict": "real",
    "commentText": "The electric bus fleet will really help cut pollution and improve public transport comfort.",
    "date": "2025-08-12",
    "time": "09:45",
    "images": ["https://i.pinimg.com/736x/f9/9d/60/f99d604374289016776e99795b120e16.jpg"]
  },
  {
    "id": 42,
    "commentId": 142,
    "newsId": 3,
    "author": "Somsak P.",
    "authorVerdict": "fake",
    "commentText": "I doubt the buses will operate as promised—maintenance is often neglected here.",
    "date": "2025-08-12",
    "time": "09:52",
    "images": ["https://i.pinimg.com/474x/bf/39/1f/bf391fe7a21414a2fa42406064d90ce9.jpg"]
  },
  {
    "id": 43,
    "commentId": 143,
    "newsId": 4,
    "author": "Anucha T.",
    "authorVerdict": "real",
    "commentText": "Clear evidence of ceasefire violations needs to be addressed immediately to prevent escalation.",
    "date": "2025-08-09",
    "time": "08:25",
    "images": ["https://i.pinimg.com/1200x/13/d2/3f/13d23fbe3ade29fcfc881ebe9df7826f.jpg"]
  },
  {
    "id": 44,
    "commentId": 144,
    "newsId": 4,
    "author": "Jirawan K.",
    "authorVerdict": "fake",
    "commentText": "This is just political maneuvering—both sides share blame for the tensions.",
    "date": "2025-08-09",
    "time": "08:40",
    "images": ["https://i.pinimg.com/736x/56/c1/89/56c189534c7ccfe16a196cd7b1ce9651.jpg"]
  },
  {
    "id": 45,
    "commentId": 145,
    "newsId": 5,
    "author": "Kanchana R.",
    "authorVerdict": "real",
    "commentText": "Glad they reached an immediate ceasefire—this could save many lives.",
    "date": "2025-08-08",
    "time": "10:15",
    "images": ["https://i.pinimg.com/736x/f5/30/a3/f530a3d5154f79f7d89187889ca1ec6a.jpg"]
  },
  {
    "id": 46,
    "commentId": 146,
    "newsId": 5,
    "author": "Chaiyapol N.",
    "authorVerdict": "fake",
    "commentText": "We’ve seen ceasefires like this fall apart quickly—don’t get too hopeful.",
    "date": "2025-08-08",
    "time": "10:22",
    "images": ["https://i.pinimg.com/736x/4d/57/bf/4d57bf82554d856f2bff68ff35846938.jpg"]
  },
  {
    "id": 47,
    "commentId": 147,
    "newsId": 6,
    "author": "Sirinapa M.",
    "authorVerdict": "real",
    "commentText": "A successful launch like this boosts confidence in our space technology sector.",
    "date": "2025-08-06",
    "time": "06:10",
    "images": ["https://i.pinimg.com/736x/61/39/57/6139576d1c7c8ae3f899742c9cf26019.jpg"]
  },
  {
    "id": 48,
    "commentId": 148,
    "newsId": 6,
    "author": "Wichai P.",
    "authorVerdict": "fake",
    "commentText": "Private launches sound good, but we should question the actual benefit to the public.",
    "date": "2025-08-06",
    "time": "06:18",
    "images": ["https://i.pinimg.com/736x/99/9e/67/999e6732d0bce1d9e780c9ac42a10b4a.jpg"]
  },
  {
    "id": 49,
    "commentId": 149,
    "newsId": 6,
    "author": "Phattharaphong S.",
    "authorVerdict": "real",
    "commentText": "Better weather satellites mean more accurate forecasts—this will help farmers a lot.",
    "date": "2025-08-06",
    "time": "06:25",
    "images": ["https://i.pinimg.com/736x/53/54/c5/5354c575c35e8691c34a00c22e44ea4c.jpg"]
  }
  ]
}



