[
  {
    "id": 1,
    "title": "Tourism in Dubai Surges as International Flights Rebound",
    "summary": "Hotel occupancy and visitor spending rise sharply as major carriers add capacity to Dubai.",
    "content": "Dubai's Department of Economy and Tourism reported a double-digit increase in visitor arrivals compared to last year. Airlines have restored routes to pre-pandemic levels, and large trade events helped lift average daily rates for hotels.",
    "status": 1,
    "reporter": "Grace Miller",
    "date": "2025-08-10",
    "time": "09:10",
    "image": "https://images.unsplash.com/photo-1526772662000-3f88f10405ff",
    "vote": { "real": 132, "fake": 21 }
  },
  {
    "id": 2,
    "title": "Swiss Court Rules Uber Drivers Are Employees",
    "summary": "Authorities say drivers should receive social security and benefits under labor law.",
    "content": "A Swiss federal ruling determined that ride-hailing drivers must be treated as employees rather than independent contractors. The decision could reshape pay, insurance, and working hours across the sector.",
    "status": 1,
    "reporter": "Alex Turner",
    "date": "2025-08-09",
    "time": "18:40",
    "image": "https://images.unsplash.com/photo-1486406146926-c627a92ad1ab",
    "vote": { "real": 98, "fake": 14 }
  },
  {
    "id": 3,
    "title": "Electric Bus Fleet Launched to Cut Urban Emissions",
    "summary": "City unveils 60 new fast-charging buses with onboard Wi-Fi and accessibility upgrades.",
    "content": "The municipal transport agency says the fleet will reduce diesel usage by 4 million liters annually. The rollout includes depot chargers and two public rapid-charging stations along the busiest corridor.",
    "status": 1,
    "reporter": "John Anderson",
    "date": "2025-08-11",
    "time": "09:30",
    "image": "https://images.unsplash.com/photo-1605296867304-46d5465a13f1",
    "vote": { "real": 120, "fake": 7 }
  },
  {
    "id": 4,
    "title": "Chocolate Cures the Common Cold, Claims Viral Post",
    "summary": "A trending article says 200g of dark chocolate a day makes you immune to colds.",
    "content": "Medical researchers say there is no clinical evidence supporting the claim. Doctors warn against excessive sugar intake and recommend rest, hydration, and vaccination for flu prevention.",
    "status": 0,
    "reporter": "Sarah Mitchell",
    "date": "2025-08-08",
    "time": "10:20",
    "image": "https://images.unsplash.com/photo-1615485290309-5e3b9e43d9f0",
    "vote": { "real": 11, "fake": 176 }
  },
  {
    "id": 5,
    "title": "Magnitude 6.2 Earthquake Strikes Coastal Region",
    "summary": "Shaking felt across several cities; emergency crews assess damage to older buildings.",
    "content": "The national seismology center recorded multiple aftershocks. Authorities reported power cuts in two districts and urged residents to check for gas leaks before returning indoors.",
    "status": 1,
    "reporter": "Hannah Ortiz",
    "date": "2025-08-07",
    "time": "22:14",
    "image": "https://images.unsplash.com/photo-1520975922215-230d5d1f38b0",
    "vote": { "real": 165, "fake": 9 }
  },
  {
    "id": 6,
    "title": "Private Rocket Successfully Delivers Weather Satellite",
    "summary": "The mission places a next-gen climate satellite into sun-synchronous orbit.",
    "content": "The launcher lifted off at dawn and deployed the satellite 58 minutes later. The spacecraft will provide higher-resolution cloud and storm data to improve regional forecasts.",
    "status": 1,
    "reporter": "Marcus Chen",
    "date": "2025-08-06",
    "time": "05:32",
    "image": "https://images.unsplash.com/photo-1446776811953-b23d57bd21aa",
    "vote": { "real": 142, "fake": 6 }
  },
  {
    "id": 7,
    "title": "Wildfire Contained After Weekend Winds Ease",
    "summary": "Firefighters report 95% containment and lift some evacuation orders.",
    "content": "More than 1,200 personnel worked through shifting winds to protect communities. Aerial tankers dropped retardant while dozers cut new firelines overnight.",
    "status": 1,
    "reporter": "Lena Park",
    "date": "2025-08-05",
    "time": "16:05",
    "image": "https://images.unsplash.com/photo-1507915135761-41a0a222c709",
    "vote": { "real": 117, "fake": 13 }
  },
  {
    "id": 8,
    "title": "National Coffee Sales Ban on Weekends to Start Next Month",
    "summary": "Screenshots claim shops must close coffee counters every Saturday and Sunday.",
    "content": "The health ministry called the rumor fabricated and urged the public to verify policies on its official portal. Trade groups said no restrictions had been discussed.",
    "status": 0,
    "reporter": "Emily Carter",
    "date": "2025-08-10",
    "time": "14:45",
    "image": "https://images.unsplash.com/photo-1511920170033-f8396924c348",
    "vote": { "real": 18, "fake": 201 }
  },
  {
    "id": 9,
    "title": "University Team Wins International Robotics Challenge",
    "summary": "Autonomous rover completes maze tasks faster than any competitor in Tokyo finals.",
    "content": "The team used a hybrid SLAM approach and custom carbon-fiber chassis. Judges praised the rover's reliability under time pressure and its obstacle-avoidance accuracy.",
    "status": 1,
    "reporter": "Michael Lee",
    "date": "2025-08-09",
    "time": "17:15",
    "image": "https://images.unsplash.com/photo-1581092160562-040e79aa9fef",
    "vote": { "real": 104, "fake": 5 }
  },
  {
    "id": 10,
    "title": "Major Retailer Confirms Data Breach Exposed Email Addresses",
    "summary": "Company says payment data was not affected; resets passwords as precaution.",
    "content": "Security teams detected unusual activity in a third-party marketing tool. The firm notified regulators and hired an external incident response provider to audit systems.",
    "status": 1,
    "reporter": "Priya Shah",
    "date": "2025-08-04",
    "time": "11:22",
    "image": "https://images.unsplash.com/photo-1518770660439-4636190af475",
    "vote": { "real": 133, "fake": 19 }
  },
  {
    "id": 11,
    "title": "Housing Prices to Drop 70% Nationwide This Autumn",
    "summary": "A widely shared chart predicts a historic crash beginning in September.",
    "content": "Economists say the chart mixes unrelated datasets and ignores employment growth. Regional markets show cooling but not a collapse, according to multiple indices.",
    "status": 0,
    "reporter": "Noah Brooks",
    "date": "2025-08-03",
    "time": "08:10",
    "image": "https://images.unsplash.com/photo-1501183638710-841dd1904471",
    "vote": { "real": 23, "fake": 154 }
  },
  {
    "id": 12,
    "title": "City Reopens Metro Line After Month-Long Repairs",
    "summary": "New rails and signaling upgrades promise quieter rides and shorter headways.",
    "content": "The transit operator replaced worn track segments and added platform screen doors at two stations. Service frequency will increase to every 3 minutes at peak.",
    "status": 1,
    "reporter": "Olivia Nguyen",
    "date": "2025-08-02",
    "time": "06:55",
    "image": "https://images.unsplash.com/photo-1507120410856-1f35574c3b45",
    "vote": { "real": 89, "fake": 7 }
  },
  {
    "id": 13,
    "title": "Local Farmers Market Introduces Cashless Stalls",
    "summary": "Vendors adopt QR payments after pilot shows faster checkout lines.",
    "content": "Organizers said the move reduces cash-handling risks and provides better sales analytics to small vendors. Cash options remain at a central booth for accessibility.",
    "status": 1,
    "reporter": "Rafael Gomez",
    "date": "2025-08-01",
    "time": "10:00",
    "image": "https://images.unsplash.com/photo-1506806732259-39c2d0268443",
    "vote": { "real": 77, "fake": 6 }
  },
  {
    "id": 14,
    "title": "Hospitals Turn Away All Patients Without Flu Shot, Says Post",
    "summary": "A screenshot claims hospitals will deny entry to unvaccinated patients.",
    "content": "Health authorities rejected the claim as false. Emergency rooms must treat all patients regardless of vaccination status under existing regulations.",
    "status": 0,
    "reporter": "Dana Reeves",
    "date": "2025-08-05",
    "time": "19:35",
    "image": "https://images.unsplash.com/photo-1586773860418-d37222d8fce3",
    "vote": { "real": 15, "fake": 138 }
  },
  {
    "id": 15,
    "title": "National Team Announces Star Forward to Return From Injury",
    "summary": "Coach confirms the striker has completed full-contact training and is match-fit.",
    "content": "Medical staff cleared the player after monitoring sprint metrics and joint stability. The forward is expected to play limited minutes in the upcoming friendly.",
    "status": 1,
    "reporter": "Megan Ross",
    "date": "2025-08-08",
    "time": "12:20",
    "image": "https://images.unsplash.com/photo-1517649763962-0c623066013b",
    "vote": { "real": 121, "fake": 8 }
  },
  {
    "id": 16,
    "title": "Flood Barriers Deployed as Heavy Rains Lash Riverside Town",
    "summary": "Authorities distribute sandbags; schools to operate online for two days.",
    "content": "Meteorologists forecast more rainfall through Tuesday. Public works crews cleared storm drains and urged motorists to avoid underpasses prone to flooding.",
    "status": 1,
    "reporter": "Ivy Collins",
    "date": "2025-08-11",
    "time": "07:05",
    "image": "https://images.unsplash.com/photo-1520659803643-78f08be0f3c4",
    "vote": { "real": 101, "fake": 12 }
  },
  {
    "id": 17,
    "title": "Tech Startup Files for IPO After Tripling Revenue",
    "summary": "Cloud-security firm targets a dual-class share structure and international expansion.",
    "content": "The company reported rising annual recurring revenue and a 120% net dollar retention rate. Proceeds will fund R&D and acquisitions in Europe and Asia.",
    "status": 1,
    "reporter": "Brian Cole",
    "date": "2025-08-06",
    "time": "13:15",
    "image": "https://images.unsplash.com/photo-1520607162513-77705c0f0d4a",
    "vote": { "real": 83, "fake": 11 }
  },
  {
    "id": 18,
    "title": "City to Replace All Streetlights With Blue LEDs Next Week",
    "summary": "Posts warn the blue lights will track people’s faces at night.",
    "content": "City hall said only warm-white LEDs are being installed to cut energy use and that cameras are not embedded in fixtures. The rumor originated from an edited procurement image.",
    "status": 0,
    "reporter": "Tom Bradley",
    "date": "2025-08-03",
    "time": "21:00",
    "image": "https://images.unsplash.com/photo-1501594907352-04cda38ebc29",
    "vote": { "real": 12, "fake": 119 }
  },
  {
    "id": 19,
    "title": "Airport Opens New Glass-Walled Observation Deck",
    "summary": "Travelers get panoramic runway views and a café with extended hours.",
    "content": "The renovation adds seating, charging points, and an aviation exhibit curated with local enthusiasts. The deck uses laminated glass to reduce noise.",
    "status": 1,
    "reporter": "Elise Wagner",
    "date": "2025-08-09",
    "time": "08:30",
    "image": "https://images.unsplash.com/photo-1461694053584-214bb49e44b3",
    "vote": { "real": 74, "fake": 5 }
  },
  {
    "id": 20,
    "title": "Community Garden Harvest Feeds 2,000 Residents",
    "summary": "Volunteers donate fresh produce to neighborhood food banks after bumper yield.",
    "content": "A mild spring and drip-irrigation upgrades boosted output across 40 plots. Organizers plan workshops on composting and seed saving next month.",
    "status": 1,
    "reporter": "Nora Patel",
    "date": "2025-08-01",
    "time": "17:45",
    "image": "https://images.unsplash.com/photo-1506806732259-39c2d0268443",
    "vote": { "real": 88, "fake": 4 }
  }
]
